#include <stdio.h>

int main() {
    int sum, p, x, y;
    sum = 0; // กำหนดค่าเริ่มต้นของผลรวมเป็น 0

    // เริ่มลูปโดยให้ x=1 และ y=1
    // ทำงานต่อเมื่อ x * y <= 15
    // ทุกครั้งที่วนลูป x จะเพิ่มทีละ 1 และ y จะเพิ่มทีละ 2
    for (x = 1, y = 1; x * y <= 15; x++, y += 2) {
        p = x * y; // คำนวณผลคูณ
        sum = sum + p; // สะสมผลรวม
        printf("%d * %d = %d\n", x, y, p); // แสดงผลแต่ละรอบ
    }

    // แสดงผลรวมทั้งหมด
    printf("summation of x * y = %d\n", sum);
    return 0;
}